precheckin/app/controllers/participants_controller.rb

  def index
    @participants = Participant.all
---
SELECT * FROM "participants"

  def show
    @participant = Participant.find(params[:id])
---
SELECT * FROM "participants" WHERE ("participants"."id" = 11)

  def create
    @participant = Participant.new(params[:participant])

    respond_to do |format|
      if @participant.save
---
INSERT INTO "participants" ("city", "ranking3", "lastName", "zip", "updated_at", "address2", "ranking", "attend", "firstName", "phone", "ticketId", "address", "attendance", "email", "created_at", "ranking2", "subscribe", "state") VALUES('Pittsburgh', 'Pool', 'Loloita', 15289, '2010-09-20 16:29:58', 'dsfsd', 'Ping-Pong', NULL, 'Lola', NULL, NULL, '234, wfnwdf', 2, 'lola@gmail.com', '2010-09-20 16:29:58', 'Poker', '0', 'PA')