precheckin/app/controllers/tickets_controller.rb

SELECT * FROM "tickets"
---
  def index
    @tickets = Ticket.all

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def show
    @ticket = Ticket.find(params[:id])

INSERT INTO "tickets" ("updated_at", "number", "code", "created_at") VALUES('2010-09-20 02:24:04', NULL, '', '2010-09-20 02:24:04')
---
  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save

SELECT * FROM "tickets" WHERE ("tickets"."id" = 8)
DELETE FROM "tickets" WHERE "id" = 8
---
  def destroy
    @ticket = Ticket.find(params[:id])
    @ticket.destroy